TestCases/Archive/BubbleShrink/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    Walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          72;
        startFace       1200;
    }
    Top
    {
        type            patch;
        nFaces          25;
        startFace       1272;
    }
    FrontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1250;
        startFace       1297;
    }
    Inlet
    {
        type            patch;
        nFaces          3;
        startFace       2547;
    }
)

// ************************************************************************* //
